In [1]:
import matplotlib.pyplot as plt
import numpy as np
import pandas as pd
import seaborn as sns

In [2]:
%matplotlib inline

In [3]:
sns.set()

In [4]:
titanic = sns.load_dataset('titanic')

In [5]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [6]:
titanic.pivot_table('survived', index='sex', columns='class')

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [7]:
titanic.groupby(['sex','class'])['survived'].describe()

sex     class
female  First   count     94.000000
                mean       0.968085
                std        0.176716
                min        0.000000
                25%        1.000000
                50%        1.000000
                75%        1.000000
                max        1.000000
        Second  count     76.000000
                mean       0.921053
                std        0.271448
                min        0.000000
                25%        1.000000
                50%        1.000000
                75%        1.000000
                max        1.000000
        Third   count    144.000000
                mean       0.500000
                std        0.501745
                min        0.000000
                25%        0.000000
                50%        0.500000
                75%        1.000000
                max        1.000000
male    First   count    122.000000
                mean       0.368852
                std        0.484484
                min        0.000000
                25%        0.000000
                50%        0.000000
                75%        1.000000
                max        1.000000
        Second  count    108.000000
                mean       0.157407
                std        0.365882
                min        0.000000
                25%        0.000000
                50%        0.000000
                75%        0.000000
                max        1.000000
        Third   count    347.000000
                mean       0.135447
                std        0.342694
                min        0.000000
                25%        0.000000
                50%        0.000000
                75%        0.000000
                max        1.000000
Name: survived, dtype: float64

In [8]:
 titanic.groupby(['sex','class'])['survived'].aggregate('mean')

sex     class
female  First     0.968085
        Second    0.921053
        Third     0.500000
male    First     0.368852
        Second    0.157407
        Third     0.135447
Name: survived, dtype: float64

In [9]:
 titanic.groupby(['sex','class'])['survived'].aggregate('mean').unstack()

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [10]:
pd.cut(titanic['age'],[0,18,80])

0      (18, 80]
1      (18, 80]
2      (18, 80]
3      (18, 80]
4      (18, 80]
5           NaN
6      (18, 80]
7       (0, 18]
8      (18, 80]
9       (0, 18]
10      (0, 18]
11     (18, 80]
12     (18, 80]
13     (18, 80]
14      (0, 18]
15     (18, 80]
16      (0, 18]
17          NaN
18     (18, 80]
19          NaN
20     (18, 80]
21     (18, 80]
22      (0, 18]
23     (18, 80]
24      (0, 18]
25     (18, 80]
26          NaN
27     (18, 80]
28          NaN
29          NaN
         ...
861    (18, 80]
862    (18, 80]
863         NaN
864    (18, 80]
865    (18, 80]
866    (18, 80]
867    (18, 80]
868         NaN
869     (0, 18]
870    (18, 80]
871    (18, 80]
872    (18, 80]
873    (18, 80]
874    (18, 80]
875     (0, 18]
876    (18, 80]
877    (18, 80]
878         NaN
879    (18, 80]
880    (18, 80]
881    (18, 80]
882    (18, 80]
883    (18, 80]
884    (18, 80]
885    (18, 80]
886    (18, 80]
887    (18, 80]
888         NaN
889    (18, 80]
890    (18, 80]
Name: age, dtype: category
Categories (2, object): [(0, 18] < (18, 80]]

In [11]:
titanic.pivot_table('survived', index=['age',pd.cut(titanic['age'],[0,18,80])], columns='class')

class              First  Second     Third
age   age
0.42  (0, 18]        NaN     NaN  1.000000
      (18, 80]       NaN     NaN       NaN
0.67  (0, 18]        NaN     1.0       NaN
      (18, 80]       NaN     NaN       NaN
0.75  (0, 18]        NaN     NaN  1.000000
      (18, 80]       NaN     NaN       NaN
0.83  (0, 18]        NaN     1.0       NaN
      (18, 80]       NaN     NaN       NaN
0.92  (0, 18]   1.000000     NaN       NaN
      (18, 80]       NaN     NaN       NaN
1.00  (0, 18]        NaN     1.0  0.600000
      (18, 80]       NaN     NaN       NaN
2.00  (0, 18]   0.000000     1.0  0.142857
      (18, 80]       NaN     NaN       NaN
3.00  (0, 18]        NaN     1.0  0.666667
      (18, 80]       NaN     NaN       NaN
4.00  (0, 18]   1.000000     1.0  0.571429
      (18, 80]       NaN     NaN       NaN
5.00  (0, 18]        NaN     1.0  1.000000
      (18, 80]       NaN     NaN       NaN
6.00  (0, 18]        NaN     1.0  0.500000
      (18, 80]       NaN     NaN       NaN
7.00  (0, 18]        NaN     1.0  0.000000
      (18, 80]       NaN     NaN       NaN
8.00  (0, 18]        NaN     1.0  0.000000
      (18, 80]       NaN     NaN       NaN
9.00  (0, 18]        NaN     NaN  0.250000
      (18, 80]       NaN     NaN       NaN
10.00 (0, 18]        NaN     NaN  0.000000
      (18, 80]       NaN     NaN       NaN
...                  ...     ...       ...
57.00 (0, 18]        NaN     NaN       NaN
      (18, 80]       NaN     0.0       NaN
58.00 (0, 18]        NaN     NaN       NaN
      (18, 80]  0.600000     NaN       NaN
59.00 (0, 18]        NaN     NaN       NaN
      (18, 80]       NaN     0.0  0.000000
60.00 (0, 18]        NaN     NaN       NaN
      (18, 80]  0.666667     0.0       NaN
61.00 (0, 18]        NaN     NaN       NaN
      (18, 80]  0.000000     NaN  0.000000
62.00 (0, 18]        NaN     NaN       NaN
      (18, 80]  0.333333     1.0       NaN
63.00 (0, 18]        NaN     NaN       NaN
      (18, 80]  1.000000     NaN  1.000000
64.00 (0, 18]        NaN     NaN       NaN
      (18, 80]  0.000000     NaN       NaN
65.00 (0, 18]        NaN     NaN       NaN
      (18, 80]  0.000000     NaN  0.000000
66.00 (0, 18]        NaN     NaN       NaN
      (18, 80]       NaN     0.0       NaN
70.00 (0, 18]        NaN     NaN       NaN
      (18, 80]  0.000000     0.0       NaN
70.50 (0, 18]        NaN     NaN       NaN
      (18, 80]       NaN     NaN  0.000000
71.00 (0, 18]        NaN     NaN       NaN
      (18, 80]  0.000000     NaN       NaN
74.00 (0, 18]        NaN     NaN       NaN
      (18, 80]       NaN     NaN  0.000000
80.00 (0, 18]        NaN     NaN       NaN
      (18, 80]  1.000000     NaN       NaN

[176 rows x 3 columns]

In [12]:
titanic.pivot_table('survived', index=['sex',pd.cut(titanic['age'],[0,18,80])], columns='class')

class               First    Second     Third
sex    age
female (0, 18]   0.909091  1.000000  0.511628
       (18, 80]  0.972973  0.900000  0.423729
male   (0, 18]   0.800000  0.600000  0.215686
       (18, 80]  0.375000  0.071429  0.133663

In [13]:
pd.info

In [14]:
pd.__version__

'0.19.2'

In [15]:
pd.show_versions()

INSTALLED VERSIONS
------------------
commit: None

pandas: 0.19.2
nose: 1.3.7
pip: 9.0.1
setuptools: 27.2.0
Cython: 0.25.2
numpy: 1.11.3
scipy: 0.18.1
statsmodels: 0.6.1
xarray: None
IPython: 5.1.0
sphinx: 1.5.1
patsy: 0.4.1
dateutil: 2.6.0
pytz: 2016.10
blosc: None
bottleneck: 1.2.0
tables: 3.3.0
numexpr: 2.6.1
matplotlib: 2.0.0
openpyxl: 2.4.1
xlrd: 1.0.0
xlwt: 1.2.0
xlsxwriter: 0.9.6
lxml: 3.7.2
bs4: 4.5.3
html5lib: None
httplib2: None
apiclient: None
sqlalchemy: 1.1.5
pymysql: None
psycopg2: None
jinja2: 2.9.4
boto: 2.45.0
pandas_datareader: None

In [16]:
data = {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
        'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
        'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [17]:
df=pd.DataFrame(data=data,index=labels)

In [18]:
df

   age animal priority  visits
a  2.5    cat      yes       1
b  3.0    cat      yes       3
c  0.5  snake       no       2
d  NaN    dog      yes       3
e  5.0    dog       no       2
f  2.0    cat       no       3
g  4.5  snake       no       1
h  NaN    cat      yes       1
i  7.0    dog       no       2
j  3.0    dog       no       1

In [19]:
df.describe()

            age     visits
count  8.000000  10.000000
mean   3.437500   1.900000
std    2.007797   0.875595
min    0.500000   1.000000
25%    2.375000   1.000000
50%    3.000000   2.000000
75%    4.625000   2.750000
max    7.000000   3.000000

In [20]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
age         8 non-null float64
animal      10 non-null object
priority    10 non-null object
visits      10 non-null int64
dtypes: float64(1), int64(1), object(2)
memory usage: 400.0+ bytes

In [21]:
df.head(3)

   age animal priority  visits
a  2.5    cat      yes       1
b  3.0    cat      yes       3
c  0.5  snake       no       2

In [22]:
df[['animal','age']]

  animal  age
a    cat  2.5
b    cat  3.0
c  snake  0.5
d    dog  NaN
e    dog  5.0
f    cat  2.0
g  snake  4.5
h    cat  NaN
i    dog  7.0
j    dog  3.0

In [23]:
df.ix[[3,4,8],['animal','age']]

  animal  age
d    dog  NaN
e    dog  5.0
i    dog  7.0

In [24]:
df[df['visits']>3]

Empty DataFrame
Columns: [age, animal, priority, visits]
Index: []

In [25]:
df[df['age'].isnull()]

   age animal priority  visits
d  NaN    dog      yes       3
h  NaN    cat      yes       1

In [26]:
df[(df['animal']=='cat') & (df['age']<3)]

   age animal priority  visits
a  2.5    cat      yes       1
f  2.0    cat       no       3

In [27]:
df[(df['age']>=2) & (df['age']<=4)]

   age animal priority  visits
a  2.5    cat      yes       1
b  3.0    cat      yes       3
f  2.0    cat       no       3
j  3.0    dog       no       1

In [28]:
df[df['age'].between(2,4)]

   age animal priority  visits
a  2.5    cat      yes       1
b  3.0    cat      yes       3
f  2.0    cat       no       3
j  3.0    dog       no       1

In [29]:
df.iloc('f')

In [30]:
df.loc['f','age']=1.5

In [31]:
df

   age animal priority  visits
a  2.5    cat      yes       1
b  3.0    cat      yes       3
c  0.5  snake       no       2
d  NaN    dog      yes       3
e  5.0    dog       no       2
f  1.5    cat       no       3
g  4.5  snake       no       1
h  NaN    cat      yes       1
i  7.0    dog       no       2
j  3.0    dog       no       1

In [32]:
df['visits'].sum()

19

In [33]:
df.groupby('animal')['age'].mean()

animal
cat      2.333333
dog      5.000000
snake    2.500000
Name: age, dtype: float64

In [34]:
df['k']=[1,2,3,4,5,6,7,8,9,0]

In [35]:
df

   age animal priority  visits  k
a  2.5    cat      yes       1  1
b  3.0    cat      yes       3  2
c  0.5  snake       no       2  3
d  NaN    dog      yes       3  4
e  5.0    dog       no       2  5
f  1.5    cat       no       3  6
g  4.5  snake       no       1  7
h  NaN    cat      yes       1  8
i  7.0    dog       no       2  9
j  3.0    dog       no       1  0

In [36]:
df.drop(['k'],inplace=True,axis=1)

In [37]:
df

   age animal priority  visits
a  2.5    cat      yes       1
b  3.0    cat      yes       3
c  0.5  snake       no       2
d  NaN    dog      yes       3
e  5.0    dog       no       2
f  1.5    cat       no       3
g  4.5  snake       no       1
h  NaN    cat      yes       1
i  7.0    dog       no       2
j  3.0    dog       no       1

In [38]:
df.groupby('animal')['animal'].count()

animal
cat      4
dog      4
snake    2
Name: animal, dtype: int64

In [39]:
df['animal'].value_counts()

cat      4
dog      4
snake    2
Name: animal, dtype: int64

In [40]:
df.sort_values(by='age', ascending=False)

   age animal priority  visits
i  7.0    dog       no       2
e  5.0    dog       no       2
g  4.5  snake       no       1
b  3.0    cat      yes       3
j  3.0    dog       no       1
a  2.5    cat      yes       1
f  1.5    cat       no       3
c  0.5  snake       no       2
d  NaN    dog      yes       3
h  NaN    cat      yes       1

In [41]:
df.sort_values(by=['age', 'visits'], ascending=[False, True])

   age animal priority  visits
i  7.0    dog       no       2
e  5.0    dog       no       2
g  4.5  snake       no       1
j  3.0    dog       no       1
b  3.0    cat      yes       3
a  2.5    cat      yes       1
f  1.5    cat       no       3
c  0.5  snake       no       2
h  NaN    cat      yes       1
d  NaN    dog      yes       3

In [42]:
df['priority'] = df['priority'].map({'yes': True, 'no': False})

In [43]:
df

   age animal priority  visits
a  2.5    cat     True       1
b  3.0    cat     True       3
c  0.5  snake    False       2
d  NaN    dog     True       3
e  5.0    dog    False       2
f  1.5    cat    False       3
g  4.5  snake    False       1
h  NaN    cat     True       1
i  7.0    dog    False       2
j  3.0    dog    False       1

In [44]:
df['animal'] = df['animal'].replace('snake', 'python')

In [45]:
df

   age  animal priority  visits
a  2.5     cat     True       1
b  3.0     cat     True       3
c  0.5  python    False       2
d  NaN     dog     True       3
e  5.0     dog    False       2
f  1.5     cat    False       3
g  4.5  python    False       1
h  NaN     cat     True       1
i  7.0     dog    False       2
j  3.0     dog    False       1

In [46]:
df.pivot_table(index='animal', columns='visits', values='age', aggfunc='mean')

visits    1    2     3
animal
cat     2.5  NaN  2.25
dog     3.0  6.0   NaN
python  4.5  0.5   NaN

In [47]:
df = pd.DataFrame({'A': [1, 2, 2, 3, 4, 5, 5, 5, 6, 7, 7]})

In [48]:
df.loc[df['A'].shift()!=df['A']]

   A
0  1
1  2
3  3
4  4
5  5
8  6
9  7

In [49]:
df = pd.DataFrame(np.random.random(size=(5, 3)))

In [50]:
df.mean()

0    0.511208
1    0.437682
2    0.404528
dtype: float64

In [51]:
df=df-df.mean()

In [52]:
df

          0         1         2
0  0.403908 -0.229148  0.004846
1 -0.373802  0.166460 -0.384924
2 -0.000020  0.085360 -0.333541
3  0.191395  0.007212  0.251243
4 -0.221480 -0.029885  0.462376

In [53]:
df.sub(df.mean(axis=1), axis=0)

          0         1         2
0  0.344039 -0.289017 -0.055022
1 -0.176380  0.363883 -0.187502
2  0.082713  0.168094 -0.250807
3  0.041445 -0.142738  0.101293
4 -0.291817 -0.100222  0.392039

In [58]:
df = pd.DataFrame(np.random.random(size=(5, 10)), columns=list('abcdefghij'))

In [62]:
df

,a,b,c,d,e,f,g,h,i,j
0,0.217174,0.088873,0.668977,0.506136,0.847647,0.403394,0.856560,0.588578,0.612409,0.911247
1,0.557654,0.985975,0.987236,0.081034,0.955526,0.073775,0.375695,0.996329,0.219871,0.151942
2,0.940439,0.919009,0.079037,0.214112,0.606313,0.711778,0.246888,0.277894,0.029089,0.474982
3,0.902748,0.982673,0.456038,0.324934,0.638944,0.499919,0.412962,0.023830,0.253795,0.353503
4,0.916734,0.626372,0.293927,0.627227,0.558627,0.322037,0.562641,0.688492,0.995006,0.381819

In [64]:
df.sum().idxmin()

'd'

In [65]:
len(df.drop_duplicates(keep=False))

5